app/controllers/downloads_controller.rb

  def index
    @downloads = Download.all(:conditions => {:system => params[:system]})
---
SELECT * FROM "downloads" WHERE ("downloads"."system" IS NULL)

  def download_game
    @download = Download.find(params[:id])
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 1)

  def create
    @download = Download.new(params[:download])

    respond_to do |format|
      if @download.save
---
INSERT INTO "downloads" ("created_at", "title", "updated_at", "url_one", "url_two") VALUES('2010-06-16 05:24:50', NULL, '2010-06-16 05:24:50', NULL, NULL)